packages.el
;; DO NOT CHANGE
;; This file is automatically generated
;; To modify configs, take a look at `config.org`

(package! py-autopep8)
(package! blacken)
(package! pip-requirements)
(package! python-pytest)
(package! python-pylint)
(package! live-py-mode)
(package! py-yapf)

(package! vala-mode)

(package! ob-http)              ;; org-babel http for REST requests
(package! eldoc-box)
(package! org-download)
(package! org-modern)
(package! denote
  :recipe (:host nil :repo "https://git.sr.ht/~protesilaos/denote"))

(package! dired-du)

(package! dockerfile-mode)
(package! nginx-mode)
(package! android-mode)
(package! subed
  :recipe (:host github :repo "sachac/subed"
           :files ("subed/*.el")))
(package! lorem-ipsum)
